<a href="https://colab.research.google.com/github/YaraMansour1985/Insurance-data-analysis-python/blob/main/Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Groupby core
**Name:** Yara Mansour

In [ ]:
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/AXSOSACADEMY/01-Fundamentals/Week02/Data/insurance_mod.csv')

df
Age_Columns=df['age']
Age_Columns.mean()

np.float64(39.20702541106129)

In [ ]:
Max_age=df['age'].max()

In [ ]:
Min_age=df['age'].min()

In [ ]:
Charges_columns=df['charges']
Charges_columns.mean()

np.float64(13270.414798206279)

In [ ]:
charges_by_sex=df.groupby('sex')['charges'].mean()
charges_by_sex

sex
female    12569.584592
male      13956.730769
Name: charges, dtype: float64

In [ ]:
charges_by_smoker=df.groupby('smoker')['charges'].mean()
charges_by_smoker

smoker
0     8434.260338
1    32050.226277
Name: charges, dtype: float64

In [ ]:
charges_by_smoker_sex=df.groupby(['smoker','sex'])['charges'].mean()
charges_by_smoker_sex

smoker  sex
0       female     8762.307130
        male       8087.177950
1       female    30678.982609
        male      33042.006289
Name: charges, dtype: float64